// אופרטור ההקצאה (=) מקצה ערך למשתנה.
// אופרטור החיבור (+) מוסיף מספרים.
// אופרטור הכפל (*) מכפיל מספרים.
// אופרטור החיסור (-) מפחית מספרים.
// אופרטור החזרה (**) בחזקת.
// אפורטור החילוק (/) יחלק מספרים.
// אופרטור "מודולו" (%) שארית החלוקה.
// אופרטור הקידום (++) יקדם את ערך המשתנה באחד.
// אופרטור ההפחתה (--) מוריד מפחית אחד ומחזיר ערך.
// אופרטור הקצאת החיבור (=+) מוסיף את הערך של האופרנד הימני למשתנה ומקצה את התוצאה למשתנה.
// אופרטור הקצאת החיסור (-=) מוריד את הערך הימני ממשתנה ומקצה את התוצאה למשתנה.
// אופרטור השוויון (==) בודק אם שני האופרנדים שלו שווים, ומחזיר תוצאה בוליאנית. בניגוד לאופרטור השוויון הקפדני, הוא מנסה להמיר ולהשוות אופרנדים מסוגים שונים.
// אופרטור השוויון הקפדני (===) בודק אם הערכים שווים בערך ובסוג שלהם.
// אופרטור הקטן מ (>)
// אופרטור הגדול מ (<)
// אופרטור הקטן שווה (=>) כלומר הערך קטן מ או שווה ל
// אופרטור הגדול שווה (=>) כלומר הערך גדול מ או שווה ל

// x = 8;
// y = 26;
// z = 3;
// v = 0; 
// b = 5;
// total = x + y * z * v + b; 
// console.log(total);



// 1

let length = 50;
let lastName = "Cohen";

console.log(typeof(length));
console.log(typeof(lastName));

const person = {
    firstName: "Avi",
    lastName: " Cohen",
};

console.log(typeof(person));

// 2

let z = 10;
let x = 5;
let y = z**x;
console.log(y);

let a = 8;
let q = 26;
let e = 3;
let c = 0;
let v = 5;
let p = a+q*e*c+v; 
console.log(p);

let n = 15;
let m = 20;
let b = n-m;
console.log(b);

let u = 100;
let i = 5;
let o = u/i;
console.log(o);

// 3

let f = 200;
let h = 100+100;
let w = f == h;
console.log(w);

